In [1]:
%reload_ext sql

In [2]:
%%sql
sqlite:///CourseDataWarehouse.db

'Connected: @CourseDataWarehouse.db'

In [3]:
%%sql
DROP TABLE import_coursemeetingsF14;  
DROP TABLE import_coursemeetingsF15;  
DROP TABLE import_coursemeetingsF16;   
DROP TABLE import_coursemeetingsF17;   
DROP TABLE import_coursemeetingsF18;   
DROP TABLE import_coursemeetingsS15;   
DROP TABLE import_coursemeetingsS16;   
DROP TABLE import_coursemeetingsS17;   
DROP TABLE import_coursemeetingsS18;  
DROP TABLE import_coursemeetingsS19;   
DROP TABLE import_coursemeetingsSB17;  
DROP TABLE import_coursemeetingsSU15;  
DROP TABLE import_coursemeetingsSU16;  
DROP TABLE import_coursemeetingsSU17;  
DROP TABLE import_coursemeetingsSU18;  
DROP TABLE import_coursemeetingsW15;   
DROP TABLE import_coursemeetingsW16;  
DROP TABLE import_coursemeetingsW17;   
DROP TABLE import_coursesF15;
DROP TABLE import_coursesF16;
DROP TABLE import_coursesF17;
DROP TABLE import_coursesF18;
DROP TABLE import_coursesS15;
DROP TABLE import_coursesS16;
DROP TABLE import_coursesS17;
DROP TABLE import_coursesS18;
DROP TABLE import_coursesS19;
DROP TABLE import_coursesSB17;
DROP TABLE import_coursesSU15;
DROP TABLE import_coursesSU16;
DROP TABLE import_coursesSU17;
DROP TABLE import_coursesSU18;
DROP TABLE import_coursesW15;
DROP TABLE import_coursesW16;
DROP TABLE import_coursesW17;
DROP TABLE import_coursesW18;

 * sqlite:///CourseDataWarehouse.db
(sqlite3.OperationalError) no such table: import_coursemeetingsF14 [SQL: 'DROP TABLE import_coursemeetingsF14;'] (Background on this error at: http://sqlalche.me/e/e3q8)

In [4]:
%%sql
CREATE TABLE CourseNum(
    term TEXT NOT NULL,
    crn INTEGER SURROGATE KEY,
    catalog_id TEXT NOT NULL
    );

 * sqlite:///CourseDataWarehouse.db
Done.

[]

In [5]:
%%sql
INSERT INTO CourseNum (term,crn,catalog_id)
SELECT DISTINCT term,crn,catalog_id
FROM courses;

 * sqlite:///CourseDataWarehouse.db
15937 rows affected.

[]

In [6]:
%%sql
SELECT *
FROM CourseNum
LIMIT 10;

 * sqlite:///CourseDataWarehouse.db
Done.

[('Fall2014', 70384, 'AC 0011'),
 ('Fall2014', 70385, 'AC 0011'),
 ('Fall2014', 70382, 'AC 0011'),
 ('Fall2014', 70291, 'AC 0011'),
 ('Fall2014', 70350, 'AC 0011'),
 ('Fall2014', 70381, 'AC 0011'),
 ('Fall2014', 70383, 'AC 0011'),
 ('Fall2014', 70391, 'AC 0011'),
 ('Fall2014', 71105, 'AC 0011'),
 ('Fall2014', 71123, 'AC 0011')]

In [8]:
%%sql
CREATE TABLE CourseTitle(
    catalog_id TEXT SURROGATE KEY,
    credits INTEGER NOT NULL,
    title TEXT NOT NULL);

 * sqlite:///CourseDataWarehouse.db
Done.

[]

In [9]:
%%sql
INSERT INTO CourseTitle (catalog_id, credits, title)
SELECT catalog_id, credits, title
FROM courses;

 * sqlite:///CourseDataWarehouse.db
15937 rows affected.

[]

In [10]:
%%sql
DROP TABLE CourseDay;

 * sqlite:///CourseDataWarehouse.db
(sqlite3.OperationalError) no such table: CourseDay [SQL: 'DROP TABLE CourseDay;'] (Background on this error at: http://sqlalche.me/e/e3q8)

In [11]:
%%sql
CREATE TABLE CourseInfo(
    crn INTEGER SURROGATE, 
    section TEXT NOT NULL,
    primary_instructor TEXT NOT NULL,
    cap INTEGER NOT NULL,
    act INTEGER NOT NULL);

 * sqlite:///CourseDataWarehouse.db
Done.

[]

In [12]:
%%sql
INSERT INTO CourseInfo (crn,section, primary_instructor, cap, act)
SELECT crn,section, primary_instructor, cap, act
FROM courses;

 * sqlite:///CourseDataWarehouse.db
15937 rows affected.

[]

In [13]:
%%sql
SELECT *
FROM CourseInfo
LIMIT 10;

 * sqlite:///CourseDataWarehouse.db
Done.

[(70384, 'C01', 'Michael P.  Coyne', 0, 31),
 (70385, 'C02', 'Michael P.  Coyne', 0, 31),
 (70382, 'C03', 'Michael P.  Coyne', 0, 31),
 (70291, 'C04', 'Rebecca I.  Bloch', 0, 29),
 (70350, 'C05', 'Rebecca I.  Bloch', 0, 30),
 (70381, 'C06', 'Rebecca I.  Bloch', 0, 31),
 (70383, 'G', 'Paul   Caster', 30, 31),
 (70391, 'H', 'Jo Ann   Drusbosky', 30, 32),
 (71105, 'I', 'Jo Ann   Drusbosky', 30, 33),
 (71123, 'J', 'Jo Ann   Drusbosky', 30, 32)]

In [14]:
%%sql
DROP TABLE import_coursemeetingsW18;

 * sqlite:///CourseDataWarehouse.db
Done.

[]

In [15]:
%%sql
DROP TABLE import_coursesF14;

 * sqlite:///CourseDataWarehouse.db
Done.

[]